In [1]:
import os

In [2]:
%pwd

'd:\\Scaler Course\\OLACaseStudy\\Ola-driver-churn\\research'

In [12]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv("D:\\Scaler Course\\OLACaseStudy\\Ola-driver-churn\\artifacts\\data_ingestion\\OLA_drivers.csv")
df.head()

,Sr,MMM-YY,Driver_ID,Age,Gender,City,Education_Level,Income,Dateofjoining,LastWorkingDate,Joining Designation,Grade,Total Business Value,Quarterly Rating
0,0,01/01/19,1,28.0,0.0,C23,2,57387,24/12/18,NaN,1,1,2381060,2
1,1,02/01/19,1,28.0,0.0,C23,2,57387,24/12/18,NaN,1,1,-665480,2
2,2,03/01/19,1,28.0,0.0,C23,2,57387,24/12/18,03/11/19,1,1,0,2
3,3,11/01/20,2,31.0,0.0,C7,2,67016,11/06/20,NaN,2,2,0,1
4,4,12/01/20,2,31.0,0.0,C7,2,67016,11/06/20,NaN,2,2,0,1

In [14]:
from sklearn.preprocessing import OneHotEncoder
ohe = OneHotEncoder(drop='first')
x = ohe.fit_transform(df['City'].values.reshape(-1,1))

In [20]:
x.toarray().shape

(19104, 28)

In [19]:
ohe.categories_[0][1:].shape

(28,)